alan-kudelko/TrinityTrack6000/MainControlBoard/STM32/STM32G473CET6/Tasks/task_CLI.c
/**
 * @addtogroup task_CLI
 * @{
 */

// In the near future create internal helper function for enqueuing data to UART1 DMA with retry
// This function should divide longer messages into smaller chunks if necessary and handle retries

// Also I should add history of typed commands after implementing helper function
// Fix: Differentiate between write and read operation when it comes to error messages and hints in `build_bus_command`

// Add change mode command to the system commands and implement it in the system dispatcher
// Note: struct TASL_CLI_COMMAND is modified to accomodate the mode switch command

#include <stm32g4xx_hal.h>
#include <string.h>
#include <stdio.h>

#include <task_CLI.h>

#include <TrinityTrack6000_Pinout.h>

#include <USART1_Dma.h>
#include <TrinityTrack6000_MemInfo.h>

#include <task_ModeManager.h>

#include <system_commands.h>

CLI_Task_State cli_task_state=CLI_STATE_DIAG_MENU; // Default state is diagnostics menu, can be changed to test menu by command

const char task_CLI_name[]="CLI Task";

TX_THREAD task_CLI_handle SECTION(".task_handles");

ULONG task_CLI_stack[TASK_CLI_STACK_SIZE];

static TX_QUEUE task_cli_wakeup_queue;
static ULONG task_cli_wakeup_queue_storage[TASK_CLI_WAKEUP_QUEUE_STORAGE_LENGTH*sizeof(TASK_CLI_WAKEUP_REASON)/sizeof(uint32_t)];

extern enum SYSTEM_MODE system_mode;

extern TX_QUEUE task_cli_request_queue;

extern bool safe_atoi(const char*str,uint8_t length,uint8_t*result);

/**
 * @addtogroup task_CLI
 * @{
 */

const char command_help[]="help";

const char command_switch_mode[]="mode";
const char command_switch_mode_diag[]="diag";
const char command_switch_mode_test[]="test";
const char*command_switch_mode_children[]={command_switch_mode_diag,command_switch_mode_test};

const char command_show[]="show";
const char command_show_mem[]="memory";
const char command_show_radio[]="radio";
const char*command_show_children[]={command_show_mem,command_show_radio};

const char command_show_mem_ram1[]="ram1";
const char command_show_mem_ram2[]="ram2";
const char command_show_mem_ccsram[]="ccsram";
const char*command_show_mem_children[]={command_show_mem_ram1,command_show_mem_ram2,command_show_mem_ccsram};

const char command_show_radio_stats[]="stats";
const char command_show_radio_runtime[]="runtime";
const char command_show_radio_settings[]="settings";
const char*command_show_radio_children[]={command_show_radio_stats,command_show_radio_runtime,command_show_radio_settings};

const char command_write[]="write";
const char command_read[]="read";

/**@} */

const char*command_array[COMMANDS_MAX_COUNT]={
    command_help,
    command_switch_mode,
    command_show,
    command_write,
    command_read};

const void (*parse_functions[COMMANDS_MAX_COUNT])(uint8_t,char*[])={
    parse_command_help,
    parse_command_switch_mode,
    parse_command_show,
    parse_command_write,
    parse_command_read};

/*
    For now let's assume that commands are divided into 2 categories
    diagnostics commands and test commands
*/

/**
 * @ingroup task_CLI
 * @{
 */
const char msg_task_CLI_help[]=
"[CLI] Available commands:\r\n\
      help - Show this help message\r\n\
      history - Show command history\r\n\
      mode <diag/test> - Switch CLI mode between diagnostics and test menu\r\n\
      show - Show various system information. Use help show for more details\r\n\
      write <device_id> <op-code> <register> <value> - Write device's raw data. Use help write for more details\r\n\
      write <hardware_id> <value> - Write value to a hardware component. Use help write for more details\r\n"
      ;

const char msg_task_CLI_help_show[]=
"[CLI] Available show commands:\r\n\
      show memory - <ram1/ram2/ccsram> Show memory information\r\n\
      show radio - <stats/runtime/settings> Show radio information\r\n"
      ;

const char msg_task_CLI_help_write[]=
"[CLI] Avaible write devices:\r\n\
      write <device_id> <op-code> <register> <value>\r\n\
      1  DEVICE_MCP1\r\n\
      2  DEVICE_MCP2\r\n\
      3  DEVICE_NRF24L01\r\n\
      4  DEVICE_ADXL345\r\n\
      5  DEVICE_GPS\r\n\
      6  DEVICE_MCP23017\r\n\
      7  DEVICE_FRAM\r\n\
      8  DEVICE_INFINEON\r\n\
      9  DEVICE_NXP\r\n\
      10 DEVICE_RENESANS\r\n\
      11 DEVICE_FPGA\r\n"
;

const char msg_task_CLI_diag_menu_header[]="[CLI] DIAG> ";
const char msg_task_CLI_test_menu_header[]="[CLI] TEST> ";
const char msg_task_CLI_unknown_command[]="[CLI] Unknown command. Type help for available commands\r\n";

const char msg_task_CLI_mode_switched_to_diag[]="[CLI] Switched to diagnostics mode\r\n";
const char msg_task_CLI_mode_switched_to_test[]="[CLI] Switched to test mode\r\n";
const char msg_task_CLI_mode_switch_failed[]="[CLI] Failed to switch mode\r\n[CLI] Correct usage: mode <diag/test>\r\n";

const char msg_task_CLI_write_executed[]="Write command executed\r\n";
const char msg_task_CLI_read_executed[]="Read command executed\r\n";
const char msg_task_CLI_read_executed_format_string[]="    Register 0x%02X: 0x%02X\r\n";
/**@} */

/**
 * @ingroup task_CLI
 * @{
 * @name CLI Task variables
 * @brief Internal variables used by the CLI task for write/read operations executed in the test menu
 * These variables are used to store the parameters of the write/read operations
 * received from the terminal and to track the status of those operations
 * They are not used in the diagnostics menu, but they can be used in the test menu
 * to perform write/read operations to devices and to provide feedback about the status of those operations back to the terminal
 * For instance, when a write command is received in the test menu, the CLI task can
 * store the parameters of that command (e.g., device ID, register address, value to write) in these variables, then it can execute the write operation and update the commandStatus variable based on the result of that operation
 * After that, it can send a message back to the terminal indicating whether the write operation was successful or if it failed with an error, and it can also provide details about the error if it failed
 * Similarly, when a read command is received in the test menu, the CLI task can execute the read operation and store the read data in the rxBuffer variable, then it can send that data back to the terminal along with a message indicating whether the read operation was successful or if it failed with an error
 * These variables can also be used to implement more complex test scenarios in the test menu where multiple write/read operations are performed in sequence and the status of each operation is tracked and reported back to the terminal
 * For instance, we can implement a test scenario where we write a value to a device, then read it back to verify that the write operation was successful, and we can report the status of each step back to the terminal
 * Overall, these variables are essential for enabling interactive testing and diagnostics through the CLI interface in the
 * test menu, allowing users to perform write/read operations and receive feedback about the status of those operations in real-time
 * Note: Actual communication is delegated to `task_SystemDispatcher` and dedicated tasks handling communication with specific devices
 */

static uint8_t txBuffer[TASK_CLI_TX_BUFFER_SIZE];
static uint8_t rxBuffer[TASK_CLI_RX_BUFFER_SIZE];
static uint32_t commandStatus;

