alan-kudelko/TrinityTrack6000/MainControlBoard/STM32/STM32G473CET6/Tasks/task_CLI.c
void parse_command_switch_mode(uint8_t argc,char*argv[]){
    // This function is called when the "mode" command is received
    // It parses the child command to determine which mode to switch to (diagnostics or test)

    if((argc<2)||(argc>2)){
        // Invalid number of arguments, send hint back to terminal indicating correct usage of the command
        while(usart1_dma_enq_data((uint8_t*)msg_task_CLI_mode_switch_failed,strlen(msg_task_CLI_mode_switch_failed))!=true){
            tx_thread_sleep(TASK_CLI_RETRY_DELAY_MS); // Sleep for a while before retrying to enqueue data to UART1 DMA
        }
        return;
    }
    // Number of arguments is valid, now check the value of the child command
    if(strncmp(argv[1],command_switch_mode_diag,strlen(command_switch_mode_diag))==0){
        // Switch to diagnostics mode
        cli_task_state=CLI_STATE_DIAG_MENU;
        while(usart1_dma_enq_data((uint8_t*)msg_task_CLI_mode_switched_to_diag,strlen(msg_task_CLI_mode_switched_to_diag))!=true){
            tx_thread_sleep(TASK_CLI_RETRY_DELAY_MS); // Sleep for a while before retrying to enqueue data to UART1 DMA
        }
    }
    else if(strncmp(argv[1],command_switch_mode_test,strlen(command_switch_mode_test))==0){
        // Switch to test mode
        cli_task_state=CLI_STATE_TEST_MENU;
        while(usart1_dma_enq_data((uint8_t*)msg_task_CLI_mode_switched_to_test,strlen(msg_task_CLI_mode_switched_to_test))!=true){
            tx_thread_sleep(TASK_CLI_RETRY_DELAY_MS); // Sleep for a while before retrying to enqueue data to UART1 DMA
        }
    }
    else{
        // Invalid child command, send hint back to terminal indicating correct usage of the command
        while(usart1_dma_enq_data((uint8_t*)msg_task_CLI_mode_switch_failed,strlen(msg_task_CLI_mode_switch_failed))!=true){
            tx_thread_sleep(TASK_CLI_RETRY_DELAY_MS); // Sleep for a while before retrying to enqueue data to UART1 DMA
        }
    }
    // Remember that when mode is set to test mode, this task should inform
    // execuite task to disable control
}

void parse_command_show(uint8_t argc,char*argv[]){
    // This function is called when the "show" command is received
    // It parses the child command to determine what information to show
    // Possible the most complex command to implement due to ambiguity of the "show" command,
    // For instance "show mem" command can have multiple child commands to specify which memory
    // information to show, so we need to implement a more complex parsing logic to handle that
    // For now just a placeholder implementation that sends a static message back to the terminal

    if(strncmp(argv[1],command_show_mem,strlen(command_show_mem))==0){
        // Show memory information
        if(argc>2){
            // Check which memory information to show based on the child command
            if(strncmp(argv[2],command_show_mem_ram1,strlen(command_show_mem_ram1))==0){
                // Show RAM1 information
                ramInfoRAM1(tx_thread_sleep,TASK_CLI_RETRY_DELAY_MS);
            }
            else if(strncmp(argv[2],command_show_mem_ram2,strlen(command_show_mem_ram2))==0){
                // Show RAM2 information
                ramInfoRAM2(tx_thread_sleep,TASK_CLI_RETRY_DELAY_MS);
            }
            else if(strncmp(argv[2],command_show_mem_ccsram,strlen(command_show_mem_ccsram))==0){
                // Show CCSRAM information
                ramInfoCCSRAM(tx_thread_sleep,TASK_CLI_RETRY_DELAY_MS);
            }
            else{
                // Invalid child command, send hint back to terminal indicating correct usage of the command
                while(usart1_dma_enq_data((uint8_t*)msg_task_CLI_unknown_command,strlen(msg_task_CLI_unknown_command))!=true){
                    tx_thread_sleep(TASK_CLI_RETRY_DELAY_MS); // Sleep for a while before retrying to enqueue data to UART1 DMA
                }
            }
        }
        else{
            // No child command provided, show general memory information
            ramInfoGeneral(tx_thread_sleep,TASK_CLI_RETRY_DELAY_MS);
        }

    }
    else if(strncmp(argv[1],command_show_radio,strlen(command_show_radio))==0){
        // Show radio information
        usart1_dma_enq_data((uint8_t*)"\r\n",2);
        if(argc>2){
            // Check which information to show based on the child command
            if(strncmp(argv[2],command_show_radio_stats,strlen(command_show_radio_stats))==0){
                // Radio stats
            }
            else if(strncmp(argv[2],command_show_radio_runtime,strlen(command_show_radio_runtime))==0){
                // Radio runtime stats from device
            }
            else if(strncmp(argv[2],command_show_radio_settings,strlen(command_show_radio_settings))==0){
                // Radio settings
            }
            else{
                // Invalid child command, send hint back to terminal indicating correct usage of the command
                while(usart1_dma_enq_data((uint8_t*)msg_task_CLI_unknown_command,strlen(msg_task_CLI_unknown_command))!=true){
                    tx_thread_sleep(TASK_CLI_RETRY_DELAY_MS); // Sleep for a while before retrying to enqueue data to UART1 DMA
                }                
            }
        }
    }
    else{
        // Too few arguments or invalid child command, send hint back to terminal indicating correct usage of the command
        while(usart1_dma_enq_data((uint8_t*)msg_task_CLI_help_show,strlen(msg_task_CLI_help_show))!=true){
            tx_thread_sleep(TASK_CLI_RETRY_DELAY_MS); // Sleep for a while before retrying to enqueue data to UART1 DMA
        }
    }
}

void parse_command_write(uint8_t argc,char*argv[]){
    // This function is called when the "write" command is received in the CLI interface
    // It parses the child command to determine which device to write to and what data to write
    // Note: some devices are not using op-codes so it's possible to send just a register and value
    if(build_bus_command(argc,argv)!=true){
        // Failed to build command, no need to send error message since build_bus_command already
        // sends hint messages back to the terminal in case of failure
        return;
    }
        // For now just send data to first device to the implementation
        //txBuffer[0]=1<<6;
        //txBuffer[1]=0x12;
        //txBuffer[2]=0x00;

    // Write operation and its callback function

    task_cli_SystemRequest.payload.rawData.rxBuffer=NULL;
    task_cli_SystemRequest.payload.rawData.rxLength=0;
    task_cli_SystemRequest.callbackFn=callback_cli_write_executed;

    tx_queue_send(&task_cli_request_queue,&task_cli_SystemRequest,TX_WAIT_FOREVER);
}

