alan-kudelko/TrinityTrack6000/MainControlBoard/STM32/STM32G473CET6/Tasks/task_CLI.c
void parse_command_read(uint8_t argc,char*argv[]){
    if(build_bus_command(argc,argv)!=true){
        // Failed to build command, no need to send error message since build_bus_command already
        // sends hint messages back to the terminal in case of failure
        return;
    }
    // Read operation and its callback function

    task_cli_SystemRequest.payload.rawData.rxBuffer=rxBuffer;
    task_cli_SystemRequest.payload.rawData.rxLength=1; // At least for now we can assume that we are only reading 1 byte
    task_cli_SystemRequest.callbackFn=callback_cli_read_executed;

    tx_queue_send(&task_cli_request_queue,&task_cli_SystemRequest,TX_WAIT_FOREVER);
}

bool build_bus_command(uint8_t argc,char*argv[]){
    if((argc<4)||(argc>5)){
        // Invalid number of arguments, send help information for the "write" command
        while(usart1_dma_enq_data((uint8_t*)msg_task_CLI_help_write,strlen(msg_task_CLI_help_write))!=true){
            tx_thread_sleep(TASK_CLI_RETRY_DELAY_MS); // Sleep for a while before retrying to enqueue data to UART1 DMA
        }
        return false;
    }
    // Try to convert argv[1] to a valid device ID (integer value is required)
    if(safe_atoi(argv[1],strlen(argv[1]),&task_cli_SystemRequest.payload.rawData.deviceId)!=true){
        // Invalid device ID, send help information for the "write" command
        while(usart1_dma_enq_data((uint8_t*)msg_task_CLI_help_write,strlen(msg_task_CLI_help_write))!=true){
            tx_thread_sleep(TASK_CLI_RETRY_DELAY_MS); // Sleep for a while before retrying to enqueue data to UART1 DMA
        }
        return false;
    }
    // Try to convert argv[2] to a valid op-code (integer value is required, value can be in decimal or hexadecimal format)
    if(safe_atoi(argv[2],strlen(argv[2]),&txBuffer[0])!=true){
        // Invalid op-code, send help information for the "write" command
        while(usart1_dma_enq_data((uint8_t*)msg_task_CLI_help_write,strlen(msg_task_CLI_help_write))!=true){
            tx_thread_sleep(TASK_CLI_RETRY_DELAY_MS); // Sleep for a while before retrying to enqueue data to UART1 DMA
        }
        return false;
    }
    // Try to convert argv[3] to a register address (integer value is required, value can be in decimal or hexadecimal format)
    if(safe_atoi(argv[3],strlen(argv[3]),&txBuffer[1])!=true){
        // Invalid register address, send help information for the "write" command
        while(usart1_dma_enq_data((uint8_t*)msg_task_CLI_help_write,strlen(msg_task_CLI_help_write))!=true){
            tx_thread_sleep(TASK_CLI_RETRY_DELAY_MS); // Sleep for a while before retrying to enqueue data to UART1 DMA
        }
        return false;
    }
    // Try to convert argv[4] to a value to write (integer value is required, value can be in decimal or hexadecimal format)
    if(argc>4){
        if(safe_atoi(argv[4],strlen(argv[4]),&txBuffer[2])!=true){
            // Invalid value to write, send help information for the "write" command
            while(usart1_dma_enq_data((uint8_t*)msg_task_CLI_help_write,strlen(msg_task_CLI_help_write))!=true){
                tx_thread_sleep(TASK_CLI_RETRY_DELAY_MS); // Sleep for a while before retrying to enqueue data to UART1 DMA
            }
            return false;
        }
    }
    
    task_cli_SystemRequest.commandType=CLI_CMD_BUS_RAW_DATA;
    task_cli_SystemRequest.payload.rawData.txBuffer=txBuffer;
    task_cli_SystemRequest.payload.rawData.txLength=argc-2;
    task_cli_SystemRequest.commandStatus=&commandStatus;

    return true;
}
// Fix this according to event parameter
// This time one callback is needed instead of 3 or more
void callback_cli_data_received(uint8_t event){
    TASK_CLI_WAKEUP_REASON wakeup;
    wakeup.wakeupReason=TASK_CLI_WAKEUP_USART_DATA;
    tx_queue_send(&task_cli_wakeup_queue,&wakeup,0);
}

void callback_cli_write_executed(uint8_t event){
    TASK_CLI_WAKEUP_REASON wakeup;
    wakeup.wakeupReason=TASK_CLI_WAKEUP_WRITE_EXECUTED;
    tx_queue_send(&task_cli_wakeup_queue,&wakeup,0);
}

void callback_cli_read_executed(uint8_t event){
    TASK_CLI_WAKEUP_REASON wakeup;
    wakeup.wakeupReason=TASK_CLI_WAKEUP_READ_EXECUTED;
    tx_queue_send(&task_cli_wakeup_queue,&wakeup,0);
}

void show_command_status(uint32_t wakeupStatus){
    // Change it to be wakeup reason depended
    switch(wakeupStatus){
        case TASK_CLI_WAKEUP_WRITE_EXECUTED:
            while(usart1_dma_enq_data((uint8_t*)msg_task_CLI_write_executed,strlen(msg_task_CLI_write_executed))!=true){
                tx_thread_sleep(TASK_CLI_RETRY_DELAY_MS);
            }
        break;
        case TASK_CLI_WAKEUP_READ_EXECUTED:
            while(usart1_dma_enq_data((uint8_t*)msg_task_CLI_read_executed,strlen(msg_task_CLI_read_executed))!=true){
                tx_thread_sleep(TASK_CLI_RETRY_DELAY_MS);
            }
            // Display read data from rxBuffer variable
            if(task_cli_SystemRequest.payload.rawData.txLength==3){
                memset(tempBuffer,0,sizeof(tempBuffer));
                snprintf(tempBuffer,
                    TASK_CLI_TEMPORARY_BUFFER_SIZE,
                    msg_task_CLI_read_executed_format_string,
                    task_cli_SystemRequest.payload.rawData.txBuffer[1], // Register address is at index 1 in the txBuffer)
                    task_cli_SystemRequest.payload.rawData.rxBuffer[0]);
                while(usart1_dma_enq_data((uint8_t*)tempBuffer,strlen(tempBuffer))!=true){
                    tx_thread_sleep(TASK_CLI_RETRY_DELAY_MS);
                }
                while(usart1_dma_enq_data((uint8_t*)"\r\n",strlen("\r\n"))!=true){
                    tx_thread_sleep(TASK_CLI_RETRY_DELAY_MS);
                }
            }
            else if(task_cli_SystemRequest.payload.rawData.txLength==2){
                memset(tempBuffer,0,sizeof(tempBuffer));
                snprintf(tempBuffer,
                    TASK_CLI_TEMPORARY_BUFFER_SIZE,
                    msg_task_CLI_read_executed_format_string,
                    task_cli_SystemRequest.payload.rawData.txBuffer[0], // Register address is at index 1 in the txBuffer)
                    task_cli_SystemRequest.payload.rawData.rxBuffer[0]);
                while(usart1_dma_enq_data((uint8_t*)tempBuffer,strlen(tempBuffer))!=true){
                    tx_thread_sleep(TASK_CLI_RETRY_DELAY_MS);
                }
                while(usart1_dma_enq_data((uint8_t*)"\r\n",strlen("\r\n"))!=true){
                    tx_thread_sleep(TASK_CLI_RETRY_DELAY_MS);
                }
            }
        break;
        default:
        // Should not happen
    }
}

void display_menu_header(void){
    // Display menu header based on current FSM state
    switch(system_mode){
        case RUN:
            while(usart1_dma_enq_data((const uint8_t*)msg_task_CLI_diag_menu_header,strlen(msg_task_CLI_diag_menu_header))!=true){
                tx_thread_sleep(TASK_CLI_RETRY_DELAY_MS); // Sleep for a while before retrying to enqueue data to UART1 DMA
            }
            break;
        case TEST:
            while(usart1_dma_enq_data((const uint8_t*)msg_task_CLI_test_menu_header,strlen(msg_task_CLI_test_menu_header))!=true){
                tx_thread_sleep(TASK_CLI_RETRY_DELAY_MS); // Sleep for a while before retrying to enqueue data to UART1 DMA
            }
            break;
        default:
            // Should never reach here, but just in case, display default menu header
            while(usart1_dma_enq_data((const uint8_t*)msg_task_CLI_diag_menu_header,strlen(msg_task_CLI_diag_menu_header))!=true){
                tx_thread_sleep(TASK_CLI_RETRY_DELAY_MS); // Sleep for a while before retrying to enqueue data to UART1 DMA
            }
            break;
    }
}

void task_CLI(ULONG arg){
    UNUSED(arg);
    char usart_rx_buffer[UART1_DMA_RX_RING_BUFFER_SIZE]={0};
    uint16_t usart_rx_length=0;

