alan-kudelko/TrinityTrack6000/MainControlBoard/STM32/STM32G473CET6/Tasks/task_CLI.c
    TASK_CLI_WAKEUP_REASON wakeup={0};

    uint8_t raw_tx_data;
    uint16_t raw_tx_data_length;

    uint8_t raw_rx_data;
    uint16_t raw_rx_data_length;

    UNUSED(raw_tx_data);
    UNUSED(raw_tx_data_length);
    UNUSED(raw_rx_data);
    UNUSED(raw_rx_data_length);

    while(1){
        // Display menu header based on current FSM state
        display_menu_header();
        // Wait for command ready semaphore // Change to queue
        // This semaphore is given in the USART1 DMA reception complete callback when a full command is received (indicated by \r or \n character)
        tx_queue_receive(&task_cli_wakeup_queue,&wakeup,TX_WAIT_FOREVER);

        switch(wakeup.wakeupReason){
            case TASK_CLI_WAKEUP_USART_DATA:
                memset(usart_rx_buffer,0,sizeof(usart_rx_buffer)); // Clear rx buffer before reading new command
                if(usart1_dma_read_data((uint8_t*)usart_rx_buffer,&usart_rx_length,UART1_DMA_RX_RING_BUFFER_SIZE-1)){
                    // Data is valid
                    // Parse command and execute corresponding actions
                    parse_command(usart_rx_buffer,usart_rx_length);
                    // This call should be FSM state depended, for instance commands used in diagnostics menu
                    // may not be available in test menu and vice versa, so we can check the current FSM state and parse commands accordingly
                }
                else{
                    // Data corrupted or error
                    // Also possible that command is empty
                    // For instance pressing enter without typing anything will result in \r or \n character being received and treated as a command, but there is no actual command to parse
                    // In this case we can choose to ignore it or send an error message back to the terminal
                    // For now just send an error message back to the terminal
                    //usart1_dma_enq_data((const uint8_t*)msg_task_CLI_unknown_command,strlen(msg_task_CLI_unknown_command));
                }
            break;
            case TASK_CLI_WAKEUP_WRITE_EXECUTED:
            case TASK_CLI_WAKEUP_READ_EXECUTED:
                show_command_status(wakeup.wakeupReason);
            break;
            case TASK_CLI_WAKEUP_RADIO_STATS_READ:

            break;
            case TASK_CLI_WAKEUP_RADIO_RUNTIME_READ:

            break;
            case TASK_CLI_WAKEUP_RADIO_SETTINGS_READ:

            break;

            default:
            // Should not happen
        }
    }
}


/**@} */